import { Outlet, useNavigate } from "react-router";
import './Home.css';
import { FaTree, FaSun } from 'react-icons/fa';

export const Home = () => {
    const nav = useNavigate();

    const show = () => {
        nav(`login`);
    };

    return (
        <>
            {/* <h1 className="titleHello">!!שמחים שאתה איתנו</h1> */}
            <button className="cta-button" onClick={() => show()}>התחברות</button>
            <Outlet />

            <br></br><br></br>
            <img src={`${process.env.PUBLIC_URL}/סופי.jpg`} alt={'רקע'} className="product_image" />

            <br></br><br></br><br></br>
            <br></br><br></br><br></br>

            <div className="tips-container">
                <div className="tip-card">
                    <h2 className="tiptitle"><FaTree /> החופשה המועדפת</h2>
                    <p className="tip-content">
                        כולנו אוהבים לנפוש ואם אפשר אז כמה פעמים בשנה. נכון שלא תמיד אפשר לקחת חופשה ארוכה מהעובדה, ולפעמים רוצים לנפוש עם הילדים בתקופת הלימודים ולכן חופשה קצרה בצימר תמיד תשחרר מעומסי השגרה ותהווה אתנחתא נעימה וקרובה לבית. צימרים רבים בישראל מציעים חווית אירוח מפנקת במיוחד ובמרבית הצימרים תוכלו ליהנות מג'קוזי ספא תחת כיפת השמיים, בריכה פרטית לאורחי המתחם ואפשרות להזמין מגוון ארוחות, טיפולי ספא, ועוד.
                    </p>
                    <h3>מול נופי המדבר או יערות בראשית של הגליל</h3>
                    <p className="tip-content">
                        מגוון הצימרים בישראל פרוסים מצפון ועד דרום וממוקמים בדרך כלל בישובים קטנים ומטופחים כשהנוף הניבט מהם מהווה חלק מחוויית האירוח. לאלו שאוהבים את נופי המדבר – צימרים בנגב או בערבה יהוו פתרון מעולה בייחוד בעונות הסתיו והאביב שמציעות באזורים אלה מזג אוויר מושלם. אזור הצפון מתאים בכל עונות השנה אך צימרים בצפון פופלארים בעיקר בעונת השיא של חודשי הקיץ בהם האזור רווי אטרקציות המשלבות מים, רפטינג בירדן, פעילויות לאורך חופי הכנרת וכמובן טיולי מים בכל נחלי הצפון לאחר שהתמלאו מתקפות החורף.
                    </p>
                    <h3>בקתת עץ כפרית או סוויטה אורבנית</h3>
                    <p className="tip-content">
                        היצע הצימרים משאיר לנו לבחור את הסגנון שאנחנו מעדיפים. בקתות העץ הכפריות שהוקמו לפני עשרות שנים עדיין שומרות על קיומן ואף משתכללות. העיצובים הכפריים הפכו למודרניים והעץ החום הפך בחלק מהמקרים ללבן אך שומר על מראהו הכפרי והאותנטי כמו שבקתת עץ צריכה להיות. אך לצד הבקתות האלה הוסבו צימרים רבים במבנה אבן, כמלון בוטיק או כמתחם סוויטות שמציע עיצוב מודרני יותר עם אבזור מתקדם ומפנק במיוחד.
                        <br />
                        <br />
                        לא משנה מה סגנון העיצוב של מתחם הנופש, אלה מה הוא מציע. האם יש בריכה במקום, או אולי בישוב, האם ארוחת הבוקר כלולה במחיר או ניתן להזמינה מראש? טיפולי ספא מפנקים שיעטפו את החופשה בניחוח מרגיע או כל אטרקציה ייחודית נוספת שניתן לשלב בחופשה.
                    </p>
                    <h3>עם הילדים, החברים או לבד לבד</h3>
                    <p className="tip-content">
                        אתם תבחרו את סוג החופשה שלכם, כי צימרים רבים ישמחו לארח אתכם עם הילדים ואף יציעו גלריית שינה נפרדת לילדים וחדר פרטי ללינת ההורים לעומת צימרים לזוגות בהם ניתן להתארח מעל גיל 18 והאירוח מיועד למבוגרים בלבד. חווית האירוח חשובה מאוד לבעלי הצימרים ולכן הם יתאימו את סגנון המקום בהתאם לקהל היעד של האורחים.
                        <br />
                        <br />
                        אז כשאתם מחליטים לנפוש עם הילדים או לבד, חשוב לשאול את בעל הצימר אם המקום מותאם לסוג החופשה שאתם רוצים, חשוב לבצע תיאום ציפיות ולוודא שאכן המקום בו תרצו לנפוש אכן מתאים לכם.
                    </p>
                </div>
                <div className="tip-card">
                    <h2 className="tiptitle"><FaSun /> טיפים לחופשה מוצלחת </h2>
                    <p className="tip-content">
                        <b>🕰️ טיימינג</b><br />
                        הדבר הכי חשוב לפני שנופשים. אם אתם ספונטניים אז תיהנו מעצם ההפתעה של היציאה לחופשה, אבל אם אתם מתכננים מראש אז דאגו לצאת לחופשה בתקופה שאין לכם עומסים או דאגות ברקע. אל תתכננו חופשה יום לאחר עקירת שן או לפני משחק כדורסל חשוב של הילד.
                    </p>
                    <p className="tip-content">
                        <b> 📃 תכנון</b><br />
                        הכי כיף לתכנן את החופשה מראש, זה יכניס אתכם לאווירת החופש עוד לפני שיצאתם מהבית. תכננו מה אתם רוצים לעשות בחופשה – האם בטן גב, האם רפטינג בירדן או חלק משביל ישראל. בכל מקרה נצלו את החופשה להכרת אזורים שאתם פחות מכירים בארץ ותיהנו מחוויה כפולה.
                    </p>
                    <p className="tip-content">
                        <b> 👕 מעט בגדים</b><br />
                        אל תעמיסו בגדים, אתם בחופש ואין צורך להיות ייצוגיים מול הטבע או ליד הבריכה. קחו כמה שפחות ותהיו רכים עם עצמכם – אפשר ללבוש את אותו הבגד גם פעמיים אם לא נשפך עליו שוקו.
                    </p>
                    <p className="tip-content">
                        <b>🌨️ תיאום ציפיות</b><br />
                        שלב חשוב לפני שיוצאים לחופשה הוא לעשות תיאום ציפיות עם עצמכם, עם בני המשפחה, בן/בת הזוג ואפילו עם הטבע והסביבה. תכנון נכון של החופשה ותיאום ציפיות גבוה מבטיח חופשה עם חוויה טובה ולא אכזבות.
                    </p>
                    <p className="tip-content">
                        <b>🎁 צו'פרים</b><br />
                        אין דיאטה בחופש ולכן תביאו אתכם את הדברים הטעימים שאתם חוסכים מעצמכם ומהילדים בשגרת ימי השבוע. הכי כיף להתפנק עם חבילת עוגיות בדרך או עם שוקולד איכותי מול הקמין החם בשעות הערב.
                    </p>
                    <p className="tip-content">
                        <b>🍽️ ביטול הארוחה אצל סבתא</b><br />
                        אל תשכחו לבטל כל דבר שעלול לשבש לכם את השלווה ואחד הדברים החשובים הוא להודיע לסבא מבעוד מועד שלא תגיעו לארוחת ערב כי אתם בחופשה. כך תוודאו שלא יתקשרו אליכם אחה"צ וישאלו אם את אתם כבר בדרך.
                    </p>
                    <p className="tip-content">
                        <b>📞 מטען לטלפון</b><br />
                        נכון שהוא הכי חשוב אבל תמיד שוכחים אותו בבית? אז שימו לכם תזכורת לא לשכוח אותו הפעם כי עם כל הכבוד לחופשה ולניתוק, אנחנו חייבים להישאר מחוברים .
                    </p>
                    <p className="tip-content">
                        <b>🤳 מקל סלפי</b><br />
                        תתפלאו כמה המוט הזה ישדרג לכם את התמונות ואין כמו תמונות וכמה שיותר כדי להנציח רגעים קסומים מול הנופים הפתוחים, או תמונה שלכם על שפת הים, הכנרת או בתוף הג'קוזי המבעבע.
                    </p>
                    <p className="tip-content">
                        🖨️  אז להדפיס ולשמור – חופשה נעימה!
                    </p>
                </div>
            </div>
            <div className="terms-container" style={{ paddingRight: '40px', paddingLeft: '40px' }}>
                <div className="terms-title">תקנון<span> </span></div>
                <div className="terms-content">
                    <br />
                    זאפ וויקנד (להלן "החברה") הינה המפעילה של אתר האינטרנט  . השימוש באתר ובתכנים המוצגים בו באמצעות מכשירי קצה שונים הינה בכפוף לתקנון ולתנאי השימוש באתר הרשומים להלן. אנא קרא תנאים אלה בעיון ובקפידה, אם אינך מסכים לכל תנאים השימוש באתר אינך רשאי לעשות שימוש כלשהו באתר זה.<br />
                    כל האמור בתקנון זה מנוסח בלשון זכר מטעמי נוחות בלבד, אולם פונה ומיועד לנשים וגברים כאחד. השימוש באתר ובתכנים המוצגים בו כפוף לתנאי התקנון המפורטים להלן. אנא קראו תנאים אלה בעיון ובקפידה, שכן הגלישה באתר, וההתייחסות לתכניו מעידים על הסכמתכם ואישורכם לאמור בתקנון זה.<br />
                    <br />
                    הנהלת החברה מאמינה בחופש הביטוי כאבן יסוד להתנהלות והתנהגות, אך בו בזמן גם מאמינה ומקפידה על שמירת חוקי מדינת ישראל. לפיכך, אין לפרסם באתר את התכנים הבאים: תכנים המעודדים לביצוע עבירות, פוגעים בפרטיות, מזיקים, מאיימים, גזעניים, בעלי אופי מיני בוטה, מוציאי לשון הרע, פוגעים ברגשות הציבור ותכנים אשר מהווים הפרה כלשהי של החוק. כמו כן תכנים אשר מכילים וירוס מחשב מכל סוג שהוא. החברה רשאית לסרב לפרסם תכנים אשר לדעתה מפרים אחד מתנאים אלו ו/או עלולים לפגוע באתר ו/או באחד המפרסמים באתר ו/או בצד שלישי כלשהו , והינה רשאית למחוק תכנים כאלו בכל עת.<br />
                    <br />
                    כל זכויות היוצרים והקניין הרוחני בעיצוב האתר ובכל התוכנה, בקוד המקור וכל חומר אחר הכלול בו שמורות לחברה למעט זכויות היוצרים והקניין הרוחני בתכנים מסוימים שהינם בבעלות המפרסמים באתר או מי מהם-כל אחד על פי זכותו.
                    <br />
                    האתר והתכנים בו מיועדים לשימוש אישי ולא מסחרי. אין להעתיק, לשנות, להפיץ, לשדר, להציג בפומבי, לבצע בפומבי, להעביר לציבור, לפרסם, לעבד, ליצור יצירות נגזרות, למכור ו/או להשכיר ו/או לאחסן כל תוכן מאתר אינטרנט זה, באופן חלקי או מלא, זמני או קבוע, בכל דרך או אמצעי, בין אם אלקטרוניים, מכאניים, אופטיים, אמצעי צילום או הקלטה, או בכל אמצעי ודרך אחרת, בלא אישור מפורש בכתב מראש של החברה ומבעלי הזכויות. כל זאת ועוד, כל סימני המסחר באתר הם קניינה של החברה למעט סימני מסחר מסוימים שהינם בבעלות המפרסמים באתר או מי-מהם-כל אחד על פי זכותו. אין לעשות בהם שימוש בלא הסכמה לכך בכתב ומראש מאת בעליו של סימן המסחר ומהחברה
                    <br />
                    <br />
                    החברה לא תשא בכל אחריות ביחס לתכנים הנמצאים ו/או המתפרסמים באתר ובכל מכשיר קצה בהם הם מופיעים, בכל הקשור לדיוקם, מהימנותן, אמינותם והשפעתם של התכנים והחומר הפרסומי שבאתר על המחשבים של הגולשים באתר וכן לכל נזק, אי נוחות, אבדן, עגמת נפש וכיוצא באלו ותוצאות ישירות או עקיפות שייגרמו לגולש, לרכושו או לכל צד שלישי בשל שימוש בתכנים אלו. החברה ממליצה לנהוג משנה זהירות לגביהם. בפרט אמורים הדברים בכל הנוגע למידע מקצועי הניתן על ידי מומחים. כל המידע המפורסם באתר אינו מהווה עצה מקצועית.<br />
                    החברה רשאית לסגור את האתר ולשנות מעת לעת את המבנה, המראה, והזמינות של השירותים והתכנים הניתנים בו וזאת ללא צורך להודיע לך על כך מראש לאף גוף המבצע שימוש כלשהו באתר. לא תהיה כל טענה, תביעה או דרישה כלפי החברה בקשר לכך. החברה אינה מתחייבת שהשירות הניתן באתר יינתן כסדרו ללא הפסקות והפרעות נזקים, קלקולים, תקלות, כשלים בחומרה, תוכנה או בקווי התקשורת אצל החברה או מי מספקיה או ייפגע מכל סיבה אחרת, והחברה לא תהא אחראית לכל נזק, ישיר או עקיף, עגמת נפש וכיו"ב שייגרמו לגולש או לרכושו עקב כך.
                    <br />
                    <br />
                    החברה רשאית להשתמש בפרטי הגולשים, שהשאירו פרטיהם באתר, לצורך שיפור השירותים שהיא מציעה באתר, וכן ליצירת קשר עמם בהצעות ודילים מעת לעת החברה לא תעביר לגופים שלישיים מידע שעלול לזהותם באופן אישי, אלא רק אם יחפצו בכך.
                    <br />
                    <br />
                    אין החברה מתחייבת כי כל הקישורים שימצאו באתר יהיו תקינים ויובילו לאתר אינטרנט פעיל. החברה אינה אחראית לכך שתוכן האתר המקושר הוא מהימן, מלא או עדכני. ולא תשא בכל אחריות בקשר לכך. מבלי לגרוע באמור לעיל החברה אינה אחראית לכל נזק, עקיף או ישיר שייגרם לך או לרכושך כתוצאה משימוש או הסתמכות על המידע והתכנים המופיעים באתרים אליהם תגיע באמצעות או דרך שימוש או קישור הקיימים באתר ו/או בגין שימוש או הסתמכות על מידע ותכנים המתפרסמים באתר ע"י צדדים שלישיים.
                    <br />
                    <br />
                    החברה רשאית לשנות את תנאי שימוש ומדיניות פרטיות אלה מעת לעת בלי למסור על כך הודעה מראש החברה תפרסם את התנאים החדשים (Privacy Policy) ותחילת תוקפם יהיה פרסומם.
                    <br />
                    <br />
                    החברה השקיעה את מיטב המאמצים כדי להבטיח שהמידע במדריך זה יהיה מדויק ואמין. אין החברה אחראית לכל תוצאה העלולה לנבוע מטעות, מהשמטה או ממידע מטעה לגבי אתרים ותכנים המופיעים באתר. התכנים המפורסמים באתר אינם בגדר המלצה, ו/או הזמנה לביקור ו/או לאירוח חינם באתרים המפורסמים בו. החברה אינה אחראית על טיב ואיכות השירות הניתן בבתי העסק המוצגים באתר האחריות חלה על בעלי העסקים בלבד. המחירים שמוצגים באתר מתעדכנים ע" בעלי בתי האירוח והעסקים והם נקבעים על ידם בלבד ולחברה אין כל אחריות על גובהם או עדכניותם.
                    <br />
                    <br />
                    באתר מוצגים גם תכנים שמקורם במשתמשי האתר לרבות חוות דעת והמלצות על מקומות האירוח או בתי העסק שבאתר, המאפשרים החלפת מידע ורשמים בין המשתמשים (להלן "המלצה/ות" או "חוות דעת") . הגולש מוזמן למלא חוות דעת במקום בו התארח או קיבל שירות, אולם עליו להתייחס בה אך ורק לבית העסק או לנותן השירותים ועל פי התרשמותו האישית בלבד. אין לעשות שימוש בפלטפורמה זו למטרה אחרת, לרבות למטרות פרסום או יחסי ציבור. החברה שומרת לעצמה את הזכות לבטל, לערוך או לשנות כל חוות דעת שפורסמה, על פי שיקול דעתה הבלעדי.<br />
                    יובהר, כי נציג מטעם מקום האירוח או בית העסק נשוא חוות הדעת יהיה רשאי להגיב לחוות הדעת, בכפוף לתנאי השימוש.<br />
                    החברה רשאית לדרוש מגולש אשר פרסם חוות דעת באתר אסמכתות וכן ראיות בכתב המוכיחות כי הוא אכן התארח במקום או קיבל את השירות ו/או המוצר נשוא חוות הדעת ולחברה יהא שיקול הדעת הבלעדי וללא כל מתן הודעה מוקדמת, להתיר את פרסום חוות הדעת ו/או התגובות או להסירן.<br />
                    החברה עשויה לבצע מעת לעת, בדיקת אמינות חוות הדעת באמצעות סקרים טלפוניים ו/או אחרים מול הגולשים שרשמו את חוות הדעת, מול מקומות האירוח ובתי העסק, וכן באמצעות בדיקות פנימיות של החברה. בהסכימך לתנאי שימוש אלו הנך מסכים כי החברה תיצור עימך קשר, באמצעות טלפון, דוא"ל, או ההודעת סמס לנייד או בכל אופן אחר לצורך ביצוע בדיקה או סקר אמינות.
                    <br />
                    החברה אינה אחראית לכל שינוי ו/או תיקון ו/או השמטה ו/או חבלה ו/או נזק מכל סוג שהוא שנעשה לתכנים אשר הועלו על-ידי המשתמשים ו/או נכתבו על-ידי המשתמשים במסגרת חוות דעת או בכל מסגרת אחרת. ייתכן כי ישונו ו/או ימחקו תכנים מסיבות שונות שאינן בשליטת החברה והחברה לא תישא בכל אחריות בנדון. החברה רשאית לשנות, מעת לעת, את המבנה ואופן התצוגה של חוות הדעת, וכן לא לפרסם חוות דעת ו/או תגובה או להסירן והכל ללא הודעה מוקדמת ועל-פי שיקול דעתה הבלעדי והמוחלט .החברה רשאית להציג את חוות הדעת ו/או תגובות ו/או המלצות הגולשים באתרים אחרים של החברה ו/או באתרים עמם יש לחברה שיתוף פעולה, בהעלותך חוות דעת הנך מסכים לכך ומאשר זאת מראש לחברה.<br /><br />
                    בעשותך שימוש באתר במסגרת מסירת תכנים לפרסום באתר, לרבות פרסום חוות דעת, חלה עליך האחריות המלאה והבלעדית לכל תוצאה אשר עשויה לנבוע מכך ועליך להימנע מלפרסם בו: (1) תכנים שהעלאתם ו/או תוכנם בלתי חוקיים ו/או נועדו למטרות בלתי חוקיות ו/או הפוגעים בפעילות המערכת; (2) תכנים בעלי אופי גזעני, פוגעני ו/או שיש בפרסומם משום לשון הרע ו/או עבירה על חוק כלשהו; (3) תכנים העלולים לפגוע ו/או להזיק לרגשות הציבור, לרבות כל תוכן בעל אופי מעליב, משמיץ, טורדני או פוגעני; (4) כל תוכן העלול להוות בסיס לקובלנה פלילית ו/או תביעה אזרחית או מהווה הפרה של כל חוק ישראלי, לרבות תוכן בלתי חוקי ו/או תוכן המעודד, מסייע או מנחה בביצוע מעשה המהווה עבירה פלילית ו/או עוולה נזיקית לפי דיני מדינת ישראל; (5) כל תוכן הפוגע ו/או עלול לפגוע בשם הטוב של מקום האירוח או נותן השירותים ו/או צד שלישי; (6) כל תוכן העלול להוות הטעייה ו/או כל תוכן הידוע למשתמש כשקרי, מטעה או מסולף; (7) תכנים הפוגעים בפרטיות; (8) תכנים אשר זכויות הקניין הרוחני בהם אינן שייכות לך; (9) תכנים בעלי אופי מסחרי ו/או המכילים מידע פרסומי כלשהו; (10) כל תוכן המזהה אישית אנשים אחרים, מבלי שנתנו את הסכמתם לפרסום זהותם ו/או (11) תכנים אשר מכילים וירוסי מחשב מכל סוג שהוא. יובהר כי החברה רשאית שלא לפרסם ו/או להסיר כל תוכן אשר כולל אחד או יותר מהסעיפים האמורים.<br /><br />
                    ייתכן שהתכנים אשר מתפרסמים בחוות הדעת אינם אמיתיים ו/או מדויקים ו/או נכונים, במלואם או בחלקם. החברה אינה אחראית לכל נזק, הפסד, חסרון כיס או הוצאה שייגרמו לך אם תפעל על בסיס המידע, התכנים או המסרים המפורסמים בהמלצות וכל הסתמכות עליהם הינה באחריותך הבלעדית.<br />
                    תכנים שיפורסמו בחוות דעת יהיו חשופים לכלל גולשי רשת האינטרנט. החברה לא תישא כלפי המשתמש באחריות ביחס לתגובות אשר יתקבלו ביחס לפרסום בהמלצות, או לכל תוצאה ו/או נזק ו/או חסרון כיס שתגרם למשתמש או לרכושו בעקבות התגובות הנ"ל. החברה לא תישא כלפי המשתמש באחריות לשימוש אשר ייעשה על ידי צד שלישי כלשהו בתכנים אשר פורסמו על-ידי המשתמש באתר.<br />
                    כל המפר תנאי הסכם זה ישפה את החברה, עובדיה, מנהליה, בעלי מניותיה או מי מטעמם בגין כל נזק, הפסד, אבדן רווח, תשלום או הוצאה שייגרמו להם, כולל הוצאות משפטיות עקב הפרת התנאי המפורטים במסמך זה. על הסכם זה יחולו אך ורק דיני מדינת ישראל. מקום השיפוט הבלעדי לכל עניין הנוגע להסכם זה והשימוש באתר הוא בבתי המשפט המוסמכים במחוז תל אביב בלבד.
                    <br />
                    <br />
                    החברה מודה מראש ומבקשת מכל אחד המוצא טעות ו/או אי דיוק בנוגע לאינפורמציה המסופקת באתר לדווח על כך למערכת.
                </div>
            </div>
            <img src={`${process.env.PUBLIC_URL}/תמונה לרקע.jpg`} alt={'jj'} className="product_image" />

        </>
    );
};
